In [5]:
import pandas as pd

In [7]:
df=pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [8]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [24]:
s=df['Name']

In [25]:
s

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [26]:
len(s)

891

In [27]:
# s[0:10] # also work but error in pd.Series(list(s),index=l) line (neeche)
s=df["Name"][0:10]

In [28]:
s

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [29]:
type(s) # series yaaani list

pandas.core.series.Series

In [38]:
l=['Amar','b','c','d','e','f','g','h','i','j']

In [31]:
pd.Series(s,index=l)

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
f    NaN
g    NaN
h    NaN
i    NaN
j    NaN
Name: Name, dtype: object

In [40]:
s1=pd.Series(list(s),index=l)

In [46]:
s1 # Named index(amar,b,c,..)

Amar                              Braund, Mr. Owen Harris
b       Cumings, Mrs. John Bradley (Florence Briggs Th...
c                                  Heikkinen, Miss. Laina
d            Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                                Allen, Mr. William Henry
f                                        Moran, Mr. James
g                                 McCarthy, Mr. Timothy J
h                          Palsson, Master. Gosta Leonard
i       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                     Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [47]:
s # s apna original index bhula nahi hai (0,1,2,..) # solution :- upar dekho s ke var mein data 0 to 10 lana hai toh kaha se bhulega [na toh usko interchange kiya kisi var se ]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [48]:
s[0]

'Braund, Mr. Owen Harris'

In [49]:
s1[0]

'Braund, Mr. Owen Harris'

In [59]:
s.append(s)
# l.append(s) # also work but give first a,b,c,d,.. in list form
# l

/tmp/ipykernel_77/2442297834.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s.append(s)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [63]:
# s1.append("Sudh") # TypeError: cannot concatenate object of type '<class 'str'>'; only Series and DataFrame objs are valid

s1.append(s) # so s append kiye

/tmp/ipykernel_77/1689827215.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s1.append(s) # so s append kiye

Amar                              Braund, Mr. Owen Harris
b       Cumings, Mrs. John Bradley (Florence Briggs Th...
c                                  Heikkinen, Miss. Laina
d            Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                                Allen, Mr. William Henry
f                                        Moran, Mr. James
g                                 McCarthy, Mr. Timothy J
h                          Palsson, Master. Gosta Leonard
i       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                     Nasser, Mrs. Nicholas (Adele Achem)
0                                 Braund, Mr. Owen Harris
1       Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                  Heikkinen, Miss. Laina
3            Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                                Allen, Mr. William Henry
5                                        Moran, Mr. James
6                                 McCarthy, Mr. Timothy J
7                          Palsson, Master. Gosta Leonard
8       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                     Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [72]:
s2=s1.append(s) # pehle s2 wala chalega then s1 wala
s2

/tmp/ipykernel_77/955170589.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s2=s1.append(s) # pehle s2 wala chalega then s1 wala

Amar                              Braund, Mr. Owen Harris
b       Cumings, Mrs. John Bradley (Florence Briggs Th...
c                                  Heikkinen, Miss. Laina
d            Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                                Allen, Mr. William Henry
f                                        Moran, Mr. James
g                                 McCarthy, Mr. Timothy J
h                          Palsson, Master. Gosta Leonard
i       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                     Nasser, Mrs. Nicholas (Adele Achem)
0                                 Braund, Mr. Owen Harris
1       Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                  Heikkinen, Miss. Laina
3            Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                                Allen, Mr. William Henry
5                                        Moran, Mr. James
6                                 McCarthy, Mr. Timothy J
7                          Palsson, Master. Gosta Leonard
8       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                     Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [73]:
s2[0]

'Braund, Mr. Owen Harris'

In [74]:
s2[4]

'Allen, Mr. William Henry'

In [133]:
s3=pd.Series([2,3,4,5,1],[1,2,3,4,5]) # data ,index
s3

1    2
2    3
3    4
4    5
5    1
dtype: int64

In [134]:
s4=pd.Series([4,3,2,3,3],[5,4'a',2,1])
s4

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1064141588.py, line 1)

In [135]:
s4.append(s3)  # pehle s4 chalega then s3

/tmp/ipykernel_77/3527145773.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s4.append(s3)  # pehle s4 chalega then s3

5    4
4    3
8    2
2    3
1    3
1    2
2    3
3    4
4    5
5    1
dtype: int64

In [136]:
s5=s4.append(s3)  # pehle s4 chalega then s3
s5

/tmp/ipykernel_77/1612695868.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s5=s4.append(s3)  # pehle s4 chalega then s3

5    4
4    3
8    2
2    3
1    3
1    2
2    3
3    4
4    5
5    1
dtype: int64

In [137]:
s5[4] # s5 k3 4 wale index par kya hai [here index doesn't means 0,1,2.. because we made index 5,4,a,x,1, and 1,2,3,4,5 ]
         # 4 index mein do data hai toh dono ko laa diya s3 and s4 dono ke data ko
         # jaha slicing operation nahi hai waha jo khud index banaya wo lega

4    3
4    5
dtype: int64

In [138]:
s5[0:4] # but s5[0 to 4 ] will give s4 data from index 0 to 4 because [here index mean real index 0,1,2,.. not our index5,4,a,x,1, and 1,2,3,4,5 ]
             #simple slicing ke case mein default index le raha

/tmp/ipykernel_77/2743105460.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  s5[0:4] # but s5[0 to 4 ] will give s4 data from index 0 to 4 because [here index mean real index 0,1,2,.. not our index5,4,a,x,1, and 1,2,3,4,5 ]

5    4
4    3
8    2
2    3
dtype: int64

In [139]:
s3

1    2
2    3
3    4
4    5
5    1
dtype: int64

In [140]:
s4

5    4
4    3
8    2
2    3
1    3
dtype: int64

In [143]:
# Now
s3*s4   # can't multiply sequence by non-int of type 'float' [our previous index our index5,4,a,x,1, and 1,2,3,4,5 ] 
        # So changing all index into int 
        # here index and index 8 are NAN because uske data mein value nahi hai means 0 se multiply huwe wo that's why NAN

1     6.0
2     9.0
3     NaN
4    15.0
5     4.0
8     NaN
dtype: float64

In [145]:
s3+s4 # same nan in 3 and 8 here also because next index mein 3 and 8 nahi hai

1    5.0
2    6.0
3    NaN
4    8.0
5    5.0
8    NaN
dtype: float64